#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-f085f7/gh-actions-demo/runs/run-jaxx5fuoCAsbcLF3

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
keycloak_openid_client.FMDB: Refreshing state... [id=db9dd8ab-0f38-4471-b396-e2ddac45a001]
keycloak_role.MOHUSER: Refreshing state... [id=94fc2570-c6df-4b46-b734-ac2a6c8c5916]
keycloak_role.PSDADMIN: Refreshing state... [id=a88f491a-3bd1-46ce-9cf6-c509f9a916f8]
keycloak_openid_user_client_role_protocol_mapper.FMDB_Role_user_client_role_mapper: Refreshing state... [id=05ef2afc-36b2-4690-8974-bb8a3b151dc1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.newclient.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = false
      + base_url                                  = "https://cgi.com"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "NEWCLIENT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "New client description"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "NEWCLIENT"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:8080/*",
          + "https://cgi.com/*",
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
        ]
    }

  # module.newclient.keycloak_openid_user_client_role_protocol_mapper.FMDB_Role_user_client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "FMDB_Role_user_client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = false
      + add_to_userinfo             = false
      + claim_name                  = "newclient_role"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "NEWCLIENT"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "Role mapper"
      + realm_id                    = "moh_applications"
    }

  # module.newclient.keycloak_role.ROLE["mapkey1"] will be created
  + resource "keycloak_role" "ROLE" {
      + client_id   = (known after apply)
      + description = "A description for role 1"
      + id          = (known after apply)
      + name        = "ROLE1"
      + realm_id    = "moh_applications"
    }

  # module.newclient.keycloak_role.ROLE["mapkey2"] will be created
  + resource "keycloak_role" "ROLE" {
      + client_id   = (known after apply)
      + description = "A description for role 2"
      + id          = (known after apply)
      + name        = "ROLE2"
      + realm_id    = "moh_applications"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 8 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*